set_property PACKAGE_PIN L16 [get_ports clk]
set_property PACKAGE_PIN P20 [get_ports {VGA_B[0]}]
set_property PACKAGE_PIN M20 [get_ports {VGA_B[1]}]
set_property PACKAGE_PIN K19 [get_ports {VGA_B[2]}]
set_property PACKAGE_PIN J18 [get_ports {VGA_B[3]}]
set_property PACKAGE_PIN H18 [get_ports {VGA_G[0]}]
set_property PACKAGE_PIN N20 [get_ports {VGA_G[1]}]
set_property PACKAGE_PIN L19 [get_ports {VGA_G[2]}]
set_property PACKAGE_PIN J19 [get_ports {VGA_G[3]}]
set_property PACKAGE_PIN P19 [get_ports VGA_hSync]
set_property PACKAGE_PIN R19 [get_ports VGA_vSync]
set_property PACKAGE_PIN M19 [get_ports {VGA_R[0]}]
set_property PACKAGE_PIN L20 [get_ports {VGA_R[1]}]
set_property PACKAGE_PIN J20 [get_ports {VGA_R[2]}]
set_property PACKAGE_PIN G20 [get_ports {VGA_R[3]}]

set_property IOSTANDARD LVCMOS33 [get_ports {VGA_B[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_B[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_B[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_B[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_G[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_G[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_G[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_G[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_hSync}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_vSync}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_R[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_R[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_R[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {VGA_R[3]}]

set_property PACKAGE_PIN Y16 [get_ports {btnL}]
set_property PACKAGE_PIN V16 [get_ports {btnR}]
set_property PACKAGE_PIN P16 [get_ports {fire}]
set_property PACKAGE_PIN R18 [get_ports {startbtn}]

set_property IOSTANDARD LVCMOS33 [get_ports {btnL}]
set_property IOSTANDARD LVCMOS33 [get_ports {btnR}]
set_property IOSTANDARD LVCMOS33 [get_ports {fire}]
set_property IOSTANDARD LVCMOS33 [get_ports {startbtn}]

create_clock -period 8.000 -name clk -waveform {0.000 5.000} [get_ports clk -filter direction==in]

set_property PACKAGE_PIN G15 [get_ports {rst}]

set_property IOSTANDARD LVCMOS33 [get_ports clk]
set_property IOSTANDARD LVCMOS33 [get_ports rst]

#set_input_delay -clock {clk} -add_delay 0.100 [get_ports btnL]
#set_input_delay -clock {clk} -add_delay 0.100 [get_ports btnR]
#set_input_delay -clock {clk} -add_delay 0.100 [get_ports fire]
#set_input_delay -clock {clk} -add_delay 0.100 [get_ports startbtn]
#set_input_delay -clock {clk} -add_delay 0.100 [get_ports rst]

#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_B[0]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_B[1]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_B[2]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_B[3]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_G[0]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_G[1]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_G[2]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_G[3]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_R[0]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_R[1]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_R[2]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_R[3]}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_hSync}]
#set_output_delay -clock {clk} -add_delay 0.200 [get_ports {VGA_vSync}]


